In [2]:
import pandas as pd

#create a simple series
s = pd.Series([10,20,30,40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [7]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age' : [24, 27, 22],
    'City' : [' New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

In [15]:
# Select a single column
print(df['Name'])



print(df[['Name', 'Age']])

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
      Name  Age
0    Alice   24
1      Bob   27
2  Charlie   22

In [16]:
# Select first two rows
print(df.iloc[:2])

    Name  Age         City
0  Alice   24     New York
1    Bob   27  Los Angeles

In [17]:
print(df.loc[1])

Name            Bob
Age              27
City    Los Angeles
Name: 1, dtype: object

In [19]:
# Select rows where Age > 23
print(df[df['Age'] > 23])

    Name  Age         City
0  Alice   24     New York
1    Bob   27  Los Angeles

In [20]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 52000, 60000, 62000, 58000]
}
df = pd.DataFrame(data)

# Group by Department and calculate the mean salary

grouped = df.groupby('Department')['Salary'].mean()
print(grouped)

Department
Finance    58000
HR         51000
IT         61000
Name: Salary, dtype: int64

In [21]:
data = {
    'City': ['New York', 'Los Angeles', 'New York', 'Chicago'],
    'Year': [2019, 2019, 2020, 2020],
    'Population': [8.4, 3.9, 8.3, 2.7]
}
df = pd.DataFrame(data)

# Create a pivot table with 'Year' as columns

pivot = df.pivot_table(values='Population', index='City', columns='Year')
print(pivot)

Year         2019  2020
City
Chicago       NaN   2.7
Los Angeles   3.9   NaN
New York      8.4   8.3

In [22]:
# Melt the DataFrame
melted = pd.melt(df, id_vars=['City'], value_vars=['Year', 'Population'])
print(melted)

          City    variable   value
0     New York        Year  2019.0
1  Los Angeles        Year  2019.0
2     New York        Year  2020.0
3      Chicago        Year  2020.0
4     New York  Population     8.4
5  Los Angeles  Population     3.9
6     New York  Population     8.3
7      Chicago  Population     2.7

In [23]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['IT', 'HR', 'IT', 'Finance'],
    'Salary': [50000, 52000, 62000, 58000]
}
df = pd.DataFrame(data)

# Filter employees with Salary > 60000

high_salary = df[df['Salary'] > 60000]
print(high_salary)

      Name Department  Salary
2  Charlie         IT   62000

In [24]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 52000, 60000, 62000, 58000]
}
df = pd.DataFrame(data)

# Group by Department and calculate the total salary

grouped = df.groupby('Department')['Salary'].sum()
print(grouped)

Department
Finance     58000
HR         102000
IT         122000
Name: Salary, dtype: int64

In [25]:
data = {
    'City': ['New York', 'New York', 'Chicago', 'Chicago'],
    'Year': [2019, 2020, 2019, 2020],
    'Sales': [200, 250, 150, 180]
}
df = pd.DataFrame(data)

# Create a pivot table
pivot = df.pivot(index='City', columns='Year', values='Sales')
print(pivot)

Year      2019  2020
City
Chicago    150   180
New York   200   250

In [30]:
# Filter employees in the IT department
it_employees = df[df['Department'] == 'IT'
print(it_employees)

SyntaxError: invalid syntax (<ipython-input-30-d757cdfe4096>, line 3)

In [42]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['IT', 'HR', 'IT', 'Finance'],
    'Salary' : [50000, 89900, 90000, 89900]
}

df = pd.DataFrame(data)

#Filer employees with Salary > 60000
df.to_excel("test1.xlsx")

In [45]:
readDF=pd.read_excel("./test1.xlsx")

readDF

   Unnamed: 0     Name Department  Salary
0           0    Alice         IT   50000
1           1      Bob         HR   89900
2           2  Charlie         IT   90000
3           3    David    Finance   89900